CSI API ETABS v1
cCaseResponseSpectrum.GetDampConstant Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetDampConstant(
	string Name,
	ref double Damp
)
Function GetDampConstant (
	Name As String,
	ByRef Damp As Double
) As Integer
Dim instance As cCaseResponseSpectrum
Dim Name As String
Dim Damp As Double
Dim returnValue As Integer
returnValue = instance.GetDampConstant(Name,
	Damp)
int GetDampConstant(
	String^ Name,
	double% Damp
)
abstract GetDampConstant :
        Name : string *
        Damp : float byref -> int
Parameters
Name
Type: System.String
Damp
Type: System.Double
Return Value
Type: Int32
See Also
Reference
cCaseResponseSpectrum Interface
ETABSv1 Namespace